Repository: pranit111/brandenbed
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: About Us
de: Über uns

source: About BrandenBed
de: Über Brandenbed

source: Your trusted partner in finding the perfect home for your academic and professional journey in Berlin.
de: Ihr vertrauenswürdiger Partner, um das perfekte Zuhause für Ihre akademische und professionelle Reise in Berlin zu finden.

source: Our Mission
de: Unsere Mission

source: At BrandenBed, we understand the challenges of finding accommodation in a new city. Our goal is to deliver a stress-free, reliable service that connects students and professionals with quality apartments that suit their needs and budgets.
de: Bei Brandenbedble verstehen wir die Herausforderungen bei der Suche nach Unterkünften in einer neuen Stadt.

source: We foster a supportive environment where residents can focus on their goals and enjoy their time in Berlin, making the transition from their home country as smooth as possible.
de: Wir fördern ein unterstützendes Umfeld, in dem sich die Bewohner auf ihre Ziele konzentrieren und ihre Zeit in Berlin genießen können, was den Übergang aus ihrem Heimatland so reibungslos wie möglich macht.

source: Why Choose BrandenBed Living Spaces
de: Warum Wählen Sie Brandenbett Living Spaces

source: We're not just a housing company - we're your partners in making Berlin feel like home.
de: Wir sind nicht nur eine Wohnungsgesellschaft - wir sind Ihre Partner, um Berlin wie zu Hause zu fühlen.

source: Local Expertise
de: Lokales Fachwissen

source: Deep knowledge of the Berlin housing scene and international student needs, ensuring you get the best accommodation options.
de: Tiefes Wissen über die Berliner Wohnungsszene und die internationalen Studentenbedürfnisse, um sicherzustellen, dass Sie die besten Unterkunftsmöglichkeiten erhalten.

source: Trusted Partnerships
de: vertrauenswürdige Partnerschaften

source: Reputable property owners and quality housing in prime locations across Berlin's most desirable neighborhoods.
de: Renommierte Immobilienbesitzer und qualitativ hochwertige Wohnungen an erstklassigen Standorten in Berlins begehrtesten Stadtteilen.

source: Commitment to Excellence
de: Engagement für Exzellenz

source: Exceptional service and long-term relationships for a positive rental experience throughout your stay in Berlin.
de: Außergewöhnlicher Service und langfristige Beziehungen für eine positive Mieterfahrung während Ihres gesamten Aufenthalts in Berlin.

source: Our Story
de: Unsere Geschichte

source: BrandenBed Living Spaces UG was founded with a simple mission: to make finding quality student accommodation in Berlin as easy and stress-free as possible.
de: Brandenbed Living Spaces UG wurde mit einer einfachen Mission gegründet: Die Suche nach qualitativ hochwertigen Studentenunterkünften in Berlin so einfach und stressfrei wie möglich.

source: As a Berlin-based housing company, we specialize in providing high-quality, fully managed accommodation for international students, expats, and young professionals who are making Germany their new home.
de: Als in Berlin ansässiges Wohnungsunternehmen sind wir auf eine qualitativ hochwertige, vollständig verwaltete Unterkunft für internationale Studenten, Expats und junge Fachkräfte spezialisiert, die Deutschland zu ihrem neuen Zuhause machen.

source: We understand the unique challenges that come with relocating to a new country, which is why we've built our services around comprehensive support - from helping with Anmeldung to creating community spaces where lifelong friendships are formed.
de: Wir verstehen die einzigartigen Herausforderungen, die mit dem Umzug in ein neues Land einhergehen. Deshalb haben wir unsere Dienste um umfassende Unterstützung aufgebaut - von der Hilfe mit Anmeldung bis hin zur Schaffung von Gemeinschaftsräumen, in denen lebenslange Freundschaften gebildet werden.

source: What We Offer
de: Was wir anbieten

source: Comprehensive housing solutions tailored for international students and young professionals.
de: umfassende Wohnungslösungen, die auf internationale Studenten und junge Fachkräfte zugeschnitten sind.

source: For Students
de: Für Studenten

source: Furnished private & shared rooms
de: Eingerichtet privat

source: All-inclusive rent (utilities, Wi-Fi, heating)
de: All-Inclusive-Miete (Versorgungsunternehmen, Wi-Fi, Heizung)

source: Multilingual tenant onboarding & support
de: Mehrsprachiger Mieter Onboarding

source: Community events & networking
de: Community -Veranstaltungen

source: For Property Owners
de: Für Immobilienbesitzer

source: Professional property management
de: Professionelle Immobilienverwaltung

source: Guaranteed rent options
de: Garantierte Mietoptionen

source: Marketing & tenant screening
de: Marketing

source: Maintenance & repairs coordination
de: Wartung

source: Transparent reporting & timely payouts
de: transparente Berichterstattung

source: Ready to Start Your Berlin Journey?
de: Bist du bereit, deine Berlin -Reise zu beginnen?

source: Whether you're a student looking for the perfect home or a property owner seeking professional management, we're here to help.
de: Egal, ob Sie ein Student sind, der nach dem perfekten Zuhause oder nach einem Eigentümer sucht, der professionelle Management sucht, wir sind hier, um zu helfen.

source: Find Housing
de: Wohnraum finden

source: Contact Us
de: Kontaktieren Sie uns

source: Premium Student Housing in Berlin
de: Premium-Studentenwohnen in Berlin

source: Get in touch with our team. We're here to help you find your perfect home in Berlin.
de: Kontakt mit unserem Team.

source: Send Us a Message
de: Senden Sie uns eine Nachricht

source: Fill out the form below and we'll get back to you within 24 hours.
de: Füllen Sie das folgende Formular aus und wir melden uns innerhalb von 24 Stunden bei Ihnen.

source: Full Name
de: Vollständiger Name

source: Your full name
de: Ihr vollständiger Name

source: Email Address
de: E -Mail -Adresse

source: Phone Number
de: Telefonnummer

source: Subject
de: Betreff

source: Choose a subject
de: Wählen Sie ein Thema

source: Housing Inquiry
de: Wohnungsanfrage

source: Property Management
de: Immobilienverwaltung

source: Resident Support
de: Unterstützung der Bewohner

source: General Question
de: Allgemeine Frage

source: Message
de: Nachricht

source: Tell us about your housing needs or questions...
de: Erzählen Sie uns von Ihren Wohnbedürfnissen oder Fragen ...

source: Send Message
de: Nachricht senden

source: Get in Touch
de: Kontakt auf den Kontakt

source: We're here to help you with all your housing needs. Reach out to us through any of the channels below.
de: Wir sind hier, um Ihnen bei all Ihren Wohnbedürfnissen zu helfen.

source: Office Address
de: Büroadresse

source: Phone Support
de: Telefonunterstützung

source: 24/7 Support:
de: 24/7 Unterstützung:

source: Office Hours:
de: Bürozeiten:

source: General Inquiries:
de: Allgemeine Anfragen:

source: Housing Support:
de: Wohnungsunterstützung:

source: Property Owners:
de: Immobilienbesitzer:

source: WhatsApp Support
de: WhatsApp -Unterstützung

source: Quick support via WhatsApp:
de: Schnelle Unterstützung über WhatsApp:

source: Available 24/7 for urgent matters
de: verfügbar rund um die Uhr für dringende Angelegenheiten

source: Office Hours
de: Bürozeiten

source: Monday - Friday:
de: Montag - Freitag:

source: Saturday:
de: Samstag:

source: Sunday:
de: Sonntag:

source: Closed
de: geschlossen

source: Emergency support available 24/7
de: Notfallunterstützung 24/7 verfügbar

source: Visit Our Office
de: Besuchen Sie unser Büro

source: Located in the heart of Berlin, we're easily accessible by public transport.
de: Im Herzen von Berlin sind wir mit öffentlichen Verkehrsmitteln leicht zugänglich.

source: Interactive Map
de: Interaktive Karte

source: Map integration would be implemented here
de: Die Kartenintegration wird hier implementiert

source: View on Google Maps
de: Ansicht auf Google Maps

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: Find quick answers to common questions about our housing services.
de: Finden Sie schnelle Antworten auf gemeinsame Fragen zu unseren Wohnungsdiensten.

source: How quickly can I move in?
de: Wie schnell kann ich hineinziehen?

source: Most of our properties are available for immediate move-in. Once your application is approved and deposit is paid, you can typically move in within 2-3 business days.
de: Die meisten unserer Eigenschaften stehen für sofortige Einschaltungen zur Verfügung.

source: What documents do I need to apply?
de: Welche Dokumente muss ich mich bewerben?

source: You'll need a valid passport/ID, proof of enrollment or employment, proof of income or financial guarantee, and completed application form. We accept international documents.
de: Sie benötigen einen gültigen Reisepass/eine gültige ID, einen Einschreibung oder eine Beschäftigung, einen Einkommens- oder finanziellen Garantie -Nachweis und ein ausgefülltes Antragsformular.

source: Do you help with Anmeldung?
de: Hilfst du bei Anmeldung?

source: Yes! We provide comprehensive Anmeldung support including appointment booking, document preparation, and accompaniment to appointments if needed.
de: Ja!

source: New
de: neu

source: 500+ Properties available for booking
de: 500 Eigenschaften zur Buchung verfügbar

source: A Home Away From Home
de: Ein Zuhause außerhalb von zu Hause

source: Discover spacious, stylish, and secure accommodation for students and professionals in Berlin. Your comfort and community start here.
de: Entdecken Sie geräumige, stilvolle und sichere Unterkünfte für Studenten und Fachleute in Berlin.

source: Find Your Home
de: Finden Sie Ihr Zuhause

source: For Landlords
de: für Vermieter

source: Trusted by Students Across Berlin
de: Vertrauen von Studenten in ganz Berlin

source: We've been helping international students find their perfect home in Berlin for years.
de: Wir helfen internationalen Studenten seit Jahren dabei, ihr perfektes Zuhause in Berlin zu finden.

source: Properties Managed
de: Eigenschaften verwaltet

source: Happy Students
de: Glückliche Schüler

source: Years Experience
de: Jahre Erfahrung

source: Districts in Berlin
de: Bezirke in Berlin

source: What Makes Us Different
de: Was macht uns anders aus

source: We go beyond just providing rooms – we create homes and communities for international students.
de: Wir gehen über die Bereitstellung von Räumen hinaus - wir schaffen Häuser und Gemeinden für internationale Studenten.

source: Fully Furnished Rooms
de: Voll möblierte Zimmer

source: Move-in ready spaces with modern furniture, high-speed WiFi, and all essentials included.
de: Einzugsfertige Räume mit modernen Möbeln, Hochgeschwindigkeits-WLAN und allen wichtigen Grundlagen.

source: 24/7 Security & Support
de: 24/7 Sicherheit

source: Round-the-clock security and multilingual support team to help you feel safe and supported.
de: Rund um die Uhr Sicherheit und mehrsprachiges Support-Team, mit dem Sie sich sicher und unterstützt fühlen.

source: All-Inclusive Pricing
de: All-inclusive-Preisgestaltung

source: Transparent pricing with utilities, WiFi, and maintenance all included. No hidden fees.
de: transparente Preisgestaltung mit Versorgungsunternehmen, WLAN und Wartung alle enthalten.

source: Registration Support
de: Anmeldung Support

source: We help with city registration and all necessary paperwork to make your move seamless.
de: Wir helfen bei der Registrierung der Stadt und allen erforderlichen Unterlagen, um Ihren Umzug nahtlos zu machen.

source: Community Events
de: Community -Veranstaltungen

source: Regular networking events and social activities to help you connect with fellow residents.
de: Regelmäßige Netzwerkveranstaltungen und soziale Aktivitäten, mit denen Sie sich mit anderen Bewohnern in Verbindung setzen können.

source: Prime Locations
de: Hauptstandorte

source: Properties near universities and public transport, perfectly connected to Berlin's best areas.
de: Immobilien in der Nähe von Universitäten und öffentlichen Verkehrsmitteln, perfekt mit Berlins besten Gebieten verbunden.

source: Ready to Find Your Home?
de: Bist du bereit, dein Zuhause zu finden?

source: Join thousands of students who have made Berlin their home with BrandenBed Living Spaces.
de: Schließen Sie sich Tausenden von Studenten an, die Berlin mit Brandenbett -Wohnräumen zu ihrem Zuhause gemacht haben.

source: Browse Properties
de: Immobilien durchsuchen

source: What Our Residents Say
de: Was unsere Bewohner sagen

source: Hear from students who have found their perfect home with us.
de: Hören Sie von Schülern, die ihr perfektes Zuhause bei uns gefunden haben.

source: BrandenBed made my move to Berlin so easy. The room was exactly as described, and the support team helped me with everything from Anmeldung to finding the nearest grocery store.
de: Brandenbed machte mich so einfach nach Berlin.

source: Master's Student, TU Berlin
de: Master -Student Tu Berlin

source: The community events helped me make friends quickly. Living in a BrandenBed property feels like being part of a real community, not just renting a room.
de: Die Community -Events haben mir geholfen, schnell Freunde zu finden.

source: Exchange Student, Humboldt University
de: Austauschstudent, Humboldt Universität

source: Premium student housing solutions in Berlin. Making relocation smooth, stress-free, and reliable for international students and young professionals.
de: Erstklassige Studentenwohnlösungen in Berlin. Wir sorgen für einen reibungslosen, stressfreien und zuverlässigen Umzug für internationale Studierende und junge Berufstätige.

source: Services
de: Dienstleistungen

source: Student Housing
de: Studentenwohnheime

source: Company
de: Firma

source: Contact
de: Kontakt

source: Careers
de: Karrieren

source: Press
de: Drücken Sie

source: Support
de: Unterstützung

source: Terms & Conditions
de: Begriffe

source: Privacy Policy
de: Datenschutzrichtlinie

source: Help Center
de: Hilfezentrum

source: All Rights Reserved.
de: Alle Rechte vorbehalten.

source: Home
de: Zuhause

source: Properties
de: Eigenschaften

source: Sign In
de: Anmelden

source: We manage. You earn. Zero drama.
de: Wir schaffen es.

source: From marketing to maintenance, BrandenBed handles every moving piece so your property stays full and fuss-free.
de: Vom Marketing bis zur Wartung verarbeitet Brandenbed jedes bewegliche Stück, sodass Ihre Immobilie voll und unkompliziert bleibt.

source: Get Started Today
de: Beginnen Sie noch heute

source: Learn More
de: Erfahren Sie mehr

source: Why Partner with BrandenBed?
de: Warum Partner mit Brandenbed?

source: Maximize your property investment with our comprehensive management services.
de: Maximieren Sie Ihre Immobilieninvestition mit unseren umfassenden Managementdiensten.

source: Guaranteed Income
de: Garantiertes Einkommen

source: Steady rental income with our guaranteed rent options. No more chasing late payments or dealing with vacancies.
de: Stabiles Mieteinkommen mit unseren garantierten Mietoptionen.

source: Zero Management Hassle
de: Zero Management Müde

source: We handle everything from tenant screening to maintenance. Enjoy passive income without the headaches.
de: Wir bearbeiten alles, vom Mieter -Screening bis zur Wartung.

source: Professional Standards
de: Professionelle Standards

source: High-quality tenants, transparent agreements, and professional property maintenance that preserves your investment.
de: Hochwertige Mieter, transparente Vereinbarungen und professionelle Immobilienwartung, die Ihre Investition bewahrt.

source: Complete Transparency
de: Komplette Transparenz

source: Real-time reporting, regular updates, and clear communication about your property's performance.
de: Echtzeitberichterstattung, regelmäßige Updates und klare Kommunikation über die Leistung Ihrer Immobilie.

source: Market Expertise
de: Marktkompetenz

source: Deep knowledge of Berlin's student housing market ensures optimal pricing and high occupancy rates.
de: Tiefes Wissen über den Berliner Studentenwohnungsmarkt sorgt für optimale Preisgestaltung und hohe Belegungsraten.

source: Property Protection
de: Eigentumsschutz

source: Regular inspections, preventive maintenance, and comprehensive insurance coverage protect your investment.
de: Regelmäßige Inspektionen, vorbeugende Wartung und umfassender Versicherungsschutz schützen Ihre Investition.

source: Common Landlord Headaches We Solve
de: Gemeinsame Vermieterkopfschmerzen, die wir lösen

source: Stop dealing with these property management nightmares.
de: Hören Sie auf, mit diesen Alpträumen der Immobilienverwaltung umzugehen.

source: Without BrandenBed
de: Ohne Brandenbed

source: Contract errors and legal paperwork
de: Vertragsfehler und legale Papierkram

source: Deposit disputes and damage claims
de: Einlagenstreitigkeiten und Schadensansprüche

source: No visibility on property performance
de: Keine Sichtbarkeit auf die Immobilienleistung

source: With BrandenBed
de: Mit Brandenbedb

source: Dynamic pricing + multi-channel advertising
de: Dynamische Preiswerbung für Mehrkanalwerbung

source: Auto CRM follow-ups + WhatsApp bot
de: Auto CRM-Follow-up WhatsApp Bot

source: Auto reminders + secure payment links
de: automatische Erinnerungen sichere Zahlungslinks sicheren Zahlungslinks

source: 24/7 vendor SLAs + spare parts inventory
de: 24/7 Anbieter Slas Ersatzteile Inventar

source: E-stamp + templates + version control
de: Versionskontrolle von E-Stamp-Vorlagen

source: Photo checklists + damage matrix
de: Foto -Checklisten Schadensmatrix

source: Owner dashboard + scheduled payouts
de: Eigentümer Dashboard geplante Auszahlungen

source: How It Works
de: Wie es funktioniert

source: Getting started is simple. Here's how we transform your property into a profitable, hassle-free investment.
de: Der Einstieg ist einfach.

source: Share Property Details
de: Immobiliendetails teilen

source: Tell us about your property location, size, and investment goals through our simple online form or phone consultation.
de: Erzählen Sie uns über unsere einfache Online -Formular- oder Telefonkonsultation von Ihrem Immobilienstandort, Größe und Investitionsziele.

source: Property specifications
de: Eigentumsspezifikationen

source: Current condition
de: Strombedingung

source: Investment expectations
de: Investitionserwartungen

source: Property Evaluation
de: Eigentumsbewertung

source: Our team visits your property to assess its potential, condition, and optimal rental pricing for the student market.
de: Unser Team besucht Ihre Immobilie, um das Potenzial, die Bedingung und die optimale Mietpreise für den Studentenmarkt zu bewerten.

source: Professional inspection
de: Professionelle Inspektion

source: Market analysis
de: Marktanalyse

source: Renovation recommendations
de: Renovierungsempfehlungen

source: Agreement & Setup
de: Vereinbarung

source: We finalize management terms, sign agreements, and set up all systems needed to start marketing your property.
de: Wir schließen die Managementbedingungen, Zeichenverträge ab und richten alle Systeme ein, die für die Vermarktung Ihrer Immobilie erforderlich sind.

source: Management contract
de: Verwaltungsvertrag

source: Property photography
de: Eigentumsfotografie

source: Listing optimization
de: Auflistungsoptimierung

source: Start Earning
de: Verdienen

source: We handle tenant screening, onboarding, and ongoing management while you receive regular rental income.
de: Wir kümmern uns um Mieter -Screening, Onboarding und laufendes Management, während Sie regelmäßige Mieteinnahmen erhalten.

source: Tenant placement
de: Mieterplatzierung

source: Monthly payouts
de: monatliche Auszahlungen

source: Performance reports
de: Leistungsberichte

source: Ready to Get Started?
de: Bereit zu beginnen?

source: Share your property details and we'll contact you within 24 hours with a customized management proposal.
de: Teilen Sie Ihre Immobiliendetails und wir werden Sie innerhalb von 24 Stunden mit einem maßgeschneiderten Verwaltungsvorschlag kontaktieren.

source: Property Type
de: Eigenschaftstyp

source: Select property type
de: Wählen Sie den Eigenschaftstyp

source: Apartment
de: Wohnung

source: House
de: Haus

source: Commercial Building
de: Handelsgebäude

source: Property Location
de: Immobilienstandort

source: District, Berlin
de: Bezirk, Berlin

source: Number of Rooms
de: Anzahl der Zimmer

source: Select room count
de: Raumanzahl auswählen

source: Room
de: Raum

source: Rooms
de: Zimmer

source: Property Details & Goals
de: Eigenschaftendetails

source: Tell us about your property condition, current rental status, and investment goals...
de: Erzählen Sie uns von Ihrer Immobilienbedingung, dem aktuellen Mietstatus und den Investitionszielen ...

source: I agree to the
de: Ich stimme dem zu

source: Terms and Conditions
de: Allgemeine Geschäftsbedingungen

source: and
de: und

source: Submit Property Information
de: Immobilieninformationen einreichen

source: What Property Owners Say
de: Was Immobilienbesitzer sagen

source: Hear from landlords who have partnered with us.
de: Hören Sie von Vermietern, die sich mit uns zusammengetan haben.

source: BrandenBed has completely transformed my rental property business. I went from constantly dealing with vacancy issues to having a steady, reliable income stream. Their professional management is outstanding.
de: Brandenbed hat mein Geschäft für Mietobjekte vollständig verändert.

source: Property Owner, Charlottenburg
de: Eigentümer, Charlottenburg

source: The transparency and communication from BrandenBed is exceptional. I receive detailed reports and my rental income is always on time. It's truly passive income now.
de: Die Transparenz und Kommunikation von Brandenbeds ist außergewöhnlich.

source: Property Owner, Friedrichshain
de: Eigentümer des Eigentümers, Friedrichshain

source: Find Your Perfect Home
de: Finden Sie Ihr perfektes Zuhause

source: Browse our collection of fully furnished, all-inclusive student accommodations across Berlin's best neighborhoods.
de: Durchsuchen Sie unsere Sammlung voll möblierter, all-inclusive-Studentenunterkünfte in den besten Stadtteilen Berlins.

source: All Districts
de: Alle Bezirke

source: Room Type
de: Zimmertyp

source: Private Room
de: Privatzimmer

source: Shared Room
de: Geteilter Raum

source: Price Range
de: Preisspanne

source: 24 properties found
de: 24 Eigenschaften gefunden

source: Available Now
de: Jetzt verfügbar

source: Modern Studio in Mitte
de: Modernes Studio in Mitte

source: Fully furnished studio apartment near Alexanderplatz. Perfect for students at Humboldt University.
de: Vollstrecktes Studio -Apartment in der Nähe von Alexanderplatz.

source: month
de: Monat

source: Study Room
de: Studienraum

source: 24/7 Security
de: 24/7 Sicherheit

source: View Details
de: Details anzeigen

source: Can't Find What You're Looking For?
de: Kannst du nicht finden, wonach du suchst?

source: Contact our team and we'll help you find the perfect accommodation that matches your needs and budget.
de: Wenden Sie sich an unser Team und wir helfen Ihnen, die perfekte Unterkunft zu finden, die Ihren Anforderungen und Ihrem Budget entspricht.

source: Our Services
de: unsere Dienstleistungen

source: Comprehensive housing solutions designed to make your Berlin experience seamless and enjoyable.
de: Umfassende Wohnungslösungen, die Ihr Berliner Erlebnis nahtlos und angenehm machen sollen.

source: Student Housing Solutions
de: Studentenwohnungslösungen

source: Everything you need to feel at home in Berlin from day one.
de: Alles, was Sie vom ersten Tag an zu Hause in Berlin fühlen müssen.

source: Fully Furnished Accommodations
de: voll möblierte Unterkünfte
