Repository: pranit111/brandenbed
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: Move into your new home with everything you need already provided. Our rooms come fully furnished with modern furniture, bedding, and all essential items.
de: Ziehen Sie in Ihr neues Zuhause mit allem, was Sie bereits zur Verfügung stellen müssen.

source: Modern furniture and appliances
de: moderne Möbel und Geräte

source: High-speed WiFi included
de: Hochgeschwindigkeits-WLAN enthalten

source: Dedicated work desk and study area
de: spezieller Schreibtisch und Studienbereich

source: Shared kitchens and common areas
de: gemeinsame Küchen und Gemeinschaftsbereiche

source: No hidden fees or surprise bills. Our transparent pricing includes everything you need for comfortable living.
de: Keine versteckten Gebühren oder Überraschungsrechnungen.

source: Utilities (electricity, heating, water)
de: Versorgungsunternehmen (Strom, Heizung, Wasser)

source: High-speed internet and WiFi
de: Hochgeschwindigkeits-Internet und WLAN

source: 24/7 maintenance and support
de: 24/7 Wartung und Unterstützung

source: Regular cleaning of common areas
de: regelmäßige Reinigung von Gemeinschaftsbereichen

source: Multilingual Support & Onboarding
de: Mehrsprachige Unterstützung

source: Our dedicated support team speaks multiple languages and helps you navigate German bureaucracy and settle into your new life.
de: Unser engagiertes Support -Team spricht mehrere Sprachen und hilft Ihnen dabei, die deutsche Bürokratie zu navigieren und sich in Ihr neues Leben niederzulassen.

source: Anmeldung (city registration) assistance
de: Anmeldung (Stadtregistrierung) Unterstützung

source: Bank account opening guidance
de: Eröffnung der Bankkontoanleitungen

source: 24/7 emergency support hotline
de: 24/7 Notunterstützung Hotline

source: Local orientation and neighborhood tours
de: Lokale Orientierung und Nachbarschaftstouren

source: Empty rooms and constant vacancies
de: leere Räume und ständige offene Stellen

source: Our Solution
de: Unsere Lösung

source: Lead ghosting and no-shows
de: Lead Ghosting und No-Shows

source: Late rent and chasing payments
de: Verspätete Miete und Verfolgung von Zahlungen

source: Contract errors and paperwork mistakes
de: Vertragsfehler und Papierkramfehler

source: 2 AM emergency repair calls
de: 2 Uhr Notfallreparaturanrufe

source: Getting started with BrandenBed is simple and straightforward.
de: Der Einstieg mit Brandenbed ist einfach und unkompliziert.

source: Tell us about your property and investment goals.
de: Erzählen Sie uns von Ihren Immobilien- und Investitionszielen.

source: We Visit & Evaluate
de: Wir besuchen

source: Our team inspects the property and assesses market potential.
de: Unser Team inspiziert die Immobilie und bewertet das Marktpotenzial.

source: Finalize Terms
de: Begriffe abschließen

source: We agree on management terms and sign the partnership agreement.
de: Wir sind uns einig auf Managementbedingungen und unterzeichnen die Partnerschaftsvereinbarung.

source: We onboard tenants and you start receiving regular rental income.
de: Wir haben Mieter an Bord und Sie erhalten regelmäßiges Mieteinkommen.

source: Whether you're looking for housing or want to maximize your property investment, we're here to help.
de: Egal, ob Sie nach Wohnraum suchen oder Ihre Immobilieninvestition maximieren möchten, wir sind hier, um zu helfen.

source: List Your Property
de: Listen Sie Ihre Eigenschaft auf

source: About Our Company
de: Über Unser Unternehmen

source: Our Values
de: Unsere Werte

source: AI-powered property management solutions
de: KI-gestützte Immobilienverwaltungslösungen

source: Your Dream Home
de: Ihr Traumhaus

source: Awaits
de: Wartet

source: Experience premium living in Berlin's most sought-after locations. Modern amenities, vibrant community, unmatched comfort.
de: Erleben Sie erstklassiges Wohnen in Berlins begehrtesten Lagen. Moderne Ausstattung, lebendige Gemeinschaft, unvergleichlicher Komfort.

source: Cozy Room in Prenzlauer Berg
de: Gemütliches Zimmer in Prenzlauer Berg

source: Available Dec 1st
de: Verfügbar ab 1. Dezember

source: Shared Apartment
de: Wohngemeinschaft

source: Bright room in shared apartment with international students. Close to Mauerpark and vibrant nightlife.
de: Helles Zimmer in Wohngemeinschaft mit internationalen Studenten. Nahe am Mauerpark und lebendiges Nachtleben.

source: WiFi
de: WLAN

source: Common Kitchen
de: Gemeinschaftsküche

source: Bike Storage
de: Fahrradkeller

source: Luxury Flat in Charlottenburg
de: Luxuswohnung in Charlottenburg

source: Entire Apartment
de: Ganze Wohnung

source: Elegant 2-bedroom apartment near TU Berlin. High-end furnishing with modern amenities and balcony.
de: Elegante 2-Zimmer-Wohnung nahe der TU Berlin. Hochwertige Ausstattung mit modernen Annehmlichkeiten und Balkon.

source: Balcony
de: Balkon

source: Dishwasher
de: Geschirrspüler

source: Open main menu
de: Hauptmenü öffnen

source: Previous
de: Zurück

source: Next
de: Weiter

source: Find Your Perfect
de: Finden Sie Ihr Perfektes

source: About
de: Über

source: Premium Student Housing
de: Premium Studentenwohnungen
